using System;

namespace Задача_6._Великденски_конкурс
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Линк към Judge: https://judge.softuni.bg/Contests/Practice/Index/1637#10
            // С наближаването на Великден, пекарна организира конкурс за направата на
            // най-хубав козунак.Напишете програма, която да намира сладкаря с най - висок
            // резултат.В началото на конкурса се въвежда броя на козунаците, които ще бъдат
            // дегустирани от посетителите на пекарната, като за всеки козунак различен брой
            // посетители, ще дадат оценка от 1 до 10.

            // Вход
            // Първоначално от конзолата се прочита броя на козунаците – цяло число в интервала[1… 100]
            int count = int.Parse(Console.ReadLine());
            string name;
            int score = 0;
            string input;
            int allScore = 0;

            // След това за всеки козунак се прочита:
            // •	Името на пекаря, който е направил козунака – текст
            // •	До получаване на командата "Stop" се прочита
            // o Оценка за козунак от един човек  – цяло число в интервала[1... 10]
            for (int i = 0; i < count; i++) 
            {
                allScore = 0;
                name = Console.ReadLine();
                while (true)
                {
                    
                    input = Console.ReadLine();
                    if (input == "Stop")
                    {
                        break;
                    }
                    score = int.Parse(input);
                    allScore += score;
                }
                
                Console.WriteLine(allScore);

            }

            
            // Изход
            // След получаване на командата "Stop" се печата един ред:
            // •	"{името на пекаря} has {общият брой получени точки} points."
            // Ако след командата "Stop", пекарят е с най-много точки до момента, да се отпечата допълнителен ред:
            // •	"{името на пекаря} is the new number 1!"
            // След дегустация на всички козунаци, да се отпечата един ред:
            // •	"{името на пекаря с най-много точки} won competition with {точките на пекаря} points!"

        }
    }
}
