using System;

namespace _4._Четни_степени_на_2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Да се напише програма, която чете число n, въведено от потребителя,
            // и печата четните степени на 2 ≤ 2n: 20, 22, 24, 26, …, 2n.

            // Създаваме променлива num за текущото число, на която присвояваме начална стойност 1.
            int n = int.Parse(Console.ReadLine());
            int num = 1;
            // За стъпка на цикъла задаваме стойност 2.
            for (int i = 0; i <= n; i += 2)
            {
                // В тялото на цикъла: oтпечатваме стойността на текущото число и увеличаваме
                // текущото число num 4 пъти(според условието на задачата).
                Console.WriteLine(num);
                num = num * 2 * 2;
            }
        }
    }
}
