using System;

namespace Задача_1._Коледна_подготовка
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Задача 1.Коледна подготовка

            // Коледа наближава, а Дядо Коледа още не е готов с подаръците.Той трябва да
            // поръча материали, с които джуджетата да изработят коледните подаръци.Всяка
            // Коледа в магазина, в който Дядо Коледа пазарува има намаление, което представлява
            // някакъв процент от цената на материалите(материалите са опаковъчна хартия във
            // вид на ролки, плат също във вид на ролки и лепило в литри).От конзолата се
            // въвеждат количеството ролки хартия, ролки плат, лепило в литри и намаление
            // в проценти.Колко пари ще са необходими на дядо Коледа, за да плати сметката
            // си, ако цените на материалите в магазина са следните:

            // Вход:
            // От конзолата се четат 4 числа:
            // •	Първи ред – брой ролки опаковъчна хартия -цяло число в интервала[0...100]
            int paperRolls = int.Parse(Console.ReadLine());
            // •	Втори ред – брой ролки плат - цяло число в интервала[0...100]
            int fabricRolls = int.Parse(Console.ReadLine());
            // •	Трети ред –  литри лепило -реално число в интервала[0.00…50.00]
            double glueLitres = double.Parse(Console.ReadLine());
            // •	Четвърти ред – процент намаление -цяло число в интервала[0...100]
            double discount = double.Parse(Console.ReadLine()) / 100;

            // •	Опаковъчна хартия -5.80 лв.за ролка
            double paper = paperRolls * 5.80;
            // •	Плат - 7.20 лв.за ролка
            double fabric = fabricRolls * 7.20;
            // •	Лепило - 1.20 лв.за литър
            double glue = glueLitres * 1.20;
            double all = paper + fabric + glue;
            double allsum = all * discount;
            double allsum1 = all - allsum;

            // Изход:
            // Да се отпечата на конзолата реално число – колко пари ще са нужни на
            // Дядо Коледа, за да си плати сметката.
            // Резултатът да се форматира до третия знак след десетичния разделител. (1.2457-> 1.246).
            Console.WriteLine($"{allsum1:f3}");

        }
    }
}
