using System;

namespace Задача_4._Компютърна_фирма
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Фирма за компютри е наела Вас, за да изчислите възможните продажби. Да се напише
            // програма, която за определен вид компютри пресмята средния рейтинг и направените
            // продажби. Първо се въвежда едно число от конзолата, което представлява броя на
            // моделите компютри. След това последователно за всеки от моделите компютри се въвежда
            // по едно число:
            // •	Последната цифра(единиците) на това число представлява рейтингът, който е в интервала[2…6].
            // •	Останалите цифри(стотици и десетици) са възможните продажби, които ще се осъществят.
            // Компютърната продажба се скалира на база рейтинг:
            // •	Рейтинг 2 взима 0 % от  възможните продажби.
            // •	Рейтинг 3 взима 50 % от възможните продажби.
            // •	Рейтинг 4 взима 70 % от възможните продажби.
            // •	Рейтинг 5 взима 85 % от възможните продажби.
            // •	Рейтинг 6 взима 100 % от възможните продажби.

            // Вход
            // От конзолата се прочита:
            // На първия ред:
            // •	n - брой компютри - цяло число в интервала[1…10]
            int pcCount = int.Parse(Console.ReadLine());
            double sum = 0;
            double sales = 0;
            double rating = 0;
            int count = 0;
            double allSales = 0;
            double allRating = 0;
            // На следващите n реда:
            // •	Числото, представляващо възможните продажби и рейтинга - цяло число в интервала[32…306]
            for (int i = 1; i <= pcCount; i++)
            {
                sum = int.Parse(Console.ReadLine());
                rating = sum % 10;
                count++;
                sales = (sum - rating) / 10;
                if (rating == 2)
                {
                    sales = sales * 0;
                }
                else if (rating == 3)
                {
                    sales = sales * 0.5;
                }
                else if (rating == 4)
                {
                    sales = sales * 0.7;
                }
                else if (rating == 5)
                {
                    sales = sales * 0.85;
                }
                else if (rating == 6)
                {
                    sales = sales * 1;
                }
                else
                {
                    Console.WriteLine("Unknown Rating");
                }
                allSales += sales;
                allRating += rating;
            }


            // Изход
            // На конзолата се отпечатват 2 редa:
            // •	Броят направени продажби
            // •	Средноаритметичният рейтинг за всички компютри
            // Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.
            Console.WriteLine($"{allSales:f2}");
            Console.WriteLine($"{allRating / count:f2}");

        }
    }
}
